Revit 2027 API
BuiltInFailures.FaceSplitterFailures.LoopsDoNotSubdivideFace Property
 Sketched loops must sub-divide the face into two or more completely enclosed regions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LoopsDoNotSubdivideFace { get; }
Public Shared ReadOnly Property LoopsDoNotSubdivideFace As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LoopsDoNotSubdivideFace {
	FailureDefinitionId^ get ();
}
static member LoopsDoNotSubdivideFace : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FaceSplitterFailures Class
Autodesk.Revit.DB Namespace